; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph3 - mode
	spectrograph2 - mode
	thermograph0 - mode
	infrared1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(have_image Phenomenon5 spectrograph2)
	(have_image Planet6 spectrograph2)
	(have_image Star7 spectrograph2)
	(have_image Star8 spectrograph3)
	(have_image Planet9 infrared1)
	(have_image Phenomenon10 thermograph0)
	(have_image Star11 infrared1)
))

)

; plan
1. (turn_to satellite1 star4 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star4)
   goals met: 0 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite1 planet6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet6)
   goals met: 0 of 7
5. (take_image satellite1 planet6 instrument2 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon5)
   goals met: 1 of 7
7. (turn_to satellite0 groundstation0 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 7
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
9. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 7
10. (take_image satellite1 phenomenon5 instrument2 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 2 of 7
11. (turn_to satellite0 phenomenon10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 7
12. (take_image satellite0 phenomenon10 instrument0 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 3 of 7
13. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 7
14. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 7
15. (turn_to satellite0 groundstation3 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 7
16. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 3 of 7
17. (turn_to satellite0 planet9 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet9)
   goals met: 3 of 7
18. (take_image satellite0 planet9 instrument1 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 4 of 7
19. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   goals met: 4 of 7
20. (take_image satellite0 star11 instrument1 infrared1)
   added: (have_image star11 infrared1)
   goals met: 5 of 7
21. (turn_to satellite0 star8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star8)
   goals met: 5 of 7
22. (take_image satellite0 star8 instrument1 spectrograph3)
   added: (have_image star8 spectrograph3)
   goals met: 6 of 7
23. (turn_to satellite1 star7 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star7)
   goals met: 6 of 7
24. (take_image satellite1 star7 instrument2 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 7 of 7
